In [1]:
import pandas as pd

In [3]:
exam_data = {'이름' : ['서준', '우현','인아'],
            '수학' : [90,80,70],
             '영어': [98,89,95],
             '음악': [85,95,100],
             '체육': [100,90,90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [4]:
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [5]:
df.iloc[0][3] = 80

In [6]:
df

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [15]:
df[1:4]

    수학  영어   음악  체육
이름
우현  80  89   95  90
인아  70  95  100  90

In [16]:
df.loc[0] = 0
df

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90
0    0   0    0   0

In [ ]:
df.loc['이름']